---
kind: type
id: T:Autodesk.Revit.DB.ImportPlacement
source: html/3c54b2eb-2378-c692-4c00-46088b684604.htm
---
# Autodesk.Revit.DB.ImportPlacement

An enumerated type listing possible placement modes for imported drawings.

## Syntax (C#)
```csharp
public enum ImportPlacement
```